open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_companion.c
/****************************************************************************
 * app/bk7258/bk7258_voice_companion.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Pure companion-v1 framing and session policy.  This module deliberately
 * owns no socket, GPIO, audio device or board resource.
 ****************************************************************************/

#include "bk7258_voice_companion.h"

#include <errno.h>
#include <stdbool.h>
#include <string.h>

static uint16_t bkvoice_get_be16(const uint8_t *data)
{
  return ((uint16_t)data[0] << 8) | data[1];
}

static uint32_t bkvoice_get_be32(const uint8_t *data)
{
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

static uint64_t bkvoice_get_be64(const uint8_t *data)
{
  return ((uint64_t)bkvoice_get_be32(data) << 32) |
         bkvoice_get_be32(data + 4);
}

static void bkvoice_put_be16(uint8_t *data, uint16_t value)
{
  data[0] = (uint8_t)(value >> 8);
  data[1] = (uint8_t)value;
}

static void bkvoice_put_be32(uint8_t *data, uint32_t value)
{
  data[0] = (uint8_t)(value >> 24);
  data[1] = (uint8_t)(value >> 16);
  data[2] = (uint8_t)(value >> 8);
  data[3] = (uint8_t)value;
}

static void bkvoice_put_be64(uint8_t *data, uint64_t value)
{
  bkvoice_put_be32(data, (uint32_t)(value >> 32));
  bkvoice_put_be32(data + 4, (uint32_t)value);
}

static int bkvoice_volume_payload_valid(uint8_t type, const uint8_t *payload)
{
  if (type == BKVOICE_COMPANION_VOLUME_SET && bkvoice_get_be32(payload) > 100)
    {
      return -ERANGE;
    }

  if (type == BKVOICE_COMPANION_VOLUME_REPORT)
    {
      uint32_t request = bkvoice_get_be32(payload);
      int32_t result = (int32_t)bkvoice_get_be32(payload + 4);
      uint32_t volume = bkvoice_get_be32(payload + 8);
      if (request == 0 || request == UINT32_MAX || result > 0 ||
          (result == 0 ? volume > 100 : volume != UINT32_MAX))
        {
          return -ERANGE;
        }
    }

  return 0;
}

static int bkvoice_status_payload_valid(const uint8_t *payload,
                                        size_t payload_len)
{
  uint8_t battery_percent = payload[1];
  uint8_t charging = payload[2];
  uint8_t battery_state = payload[3];
  uint16_t fw_major = bkvoice_get_be16(payload + 8);
  uint16_t fw_minor = bkvoice_get_be16(payload + 10);
  uint16_t fw_revision = bkvoice_get_be16(payload + 12);
  uint16_t reserved = bkvoice_get_be16(payload + 14);
  uint32_t fw_build = bkvoice_get_be32(payload + 16);
  bool firmware_unknown;
  bool root_all_zero = true;
  bool root_all_erased = true;
  size_t index;

  if ((payload_len != BKVOICE_COMPANION_STATUS_REPORT_BYTES &&
       payload_len != BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES) ||
      (payload_len == BKVOICE_COMPANION_STATUS_REPORT_BYTES &&
       payload[0] != 1) ||
      (payload_len == BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES &&
       payload[0] != 2) ||
      (battery_percent > 100 && battery_percent != BKVOICE_COMPANION_BATTERY_UNKNOWN) ||
      charging > 2 ||
      (battery_state > BKVOICE_COMPANION_BATTERY_STATE_FAULT &&
       battery_state != BKVOICE_COMPANION_BATTERY_UNKNOWN) ||
      reserved != 0)
    {
      return -ERANGE;
    }

  firmware_unknown = fw_major == BKVOICE_COMPANION_FW_UNKNOWN &&
                     fw_minor == BKVOICE_COMPANION_FW_UNKNOWN &&
                     fw_revision == BKVOICE_COMPANION_FW_UNKNOWN &&
                     fw_build == BKVOICE_COMPANION_FW_BUILD_UNKNOWN;

  if (payload_len == BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES)
    {
      for (index = BKVOICE_COMPANION_STATUS_REPORT_BYTES;
           index < BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES; index++)
        {
          root_all_zero = root_all_zero && payload[index] == 0u;
          root_all_erased = root_all_erased && payload[index] == 0xffu;
        }

      if (firmware_unknown || root_all_zero || root_all_erased)
        {
          return -ERANGE;
        }
    }

  if (!firmware_unknown &&
      (fw_major == BKVOICE_COMPANION_FW_UNKNOWN ||
       fw_minor == BKVOICE_COMPANION_FW_UNKNOWN ||
       fw_revision == BKVOICE_COMPANION_FW_UNKNOWN ||
       fw_build == BKVOICE_COMPANION_FW_BUILD_UNKNOWN))
    {
      return -ERANGE;
    }

  if ((battery_state == BKVOICE_COMPANION_BATTERY_STATE_CHARGING && charging != 1) ||
      ((battery_state == BKVOICE_COMPANION_BATTERY_STATE_IDLE ||
        battery_state == BKVOICE_COMPANION_BATTERY_STATE_FULL ||
        battery_state == BKVOICE_COMPANION_BATTERY_STATE_DISCHARGING) && charging != 0) ||
      ((battery_state == BKVOICE_COMPANION_BATTERY_STATE_UNKNOWN ||
        battery_state == BKVOICE_COMPANION_BATTERY_STATE_FAULT ||
        battery_state == BKVOICE_COMPANION_BATTERY_UNKNOWN) && charging != 2))
    {
      return -ERANGE;
    }

  return 0;
}

static bool bkvoice_ota_digest_valid(const uint8_t *digest)
{
  bool all_zero = true;
  bool all_erased = true;
  size_t index;

  for (index = 0; index < BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES;
       index++)
    {
      all_zero = all_zero && digest[index] == 0u;
      all_erased = all_erased && digest[index] == 0xffu;
    }

  return !all_zero && !all_erased;
}

static bool bkvoice_ota_phase_valid(uint8_t phase)
{
  return phase >= BKVOICE_COMPANION_OTA_DOWNLOADING &&
         phase <= BKVOICE_COMPANION_OTA_FAILED;
}

static int bkvoice_ota_payload_valid(uint8_t type, const uint8_t *payload)
{
  int32_t result;
  uint8_t phase;

  if (type == BKVOICE_COMPANION_OTA_REQUEST)
    {
      return bkvoice_ota_digest_valid(payload) ? 0 : -ERANGE;
    }

  if (type != BKVOICE_COMPANION_OTA_REPORT)
    {
      return 0;
    }

  result = (int32_t)bkvoice_get_be32(payload + 4);
  phase = payload[8];
  if (bkvoice_get_be32(payload) == 0 || result > 0 ||
      !bkvoice_ota_phase_valid(phase) || payload[9] > 100u ||
      bkvoice_get_be16(payload + 10) != 0 ||
      !bkvoice_ota_digest_valid(payload + 12) ||
      ((phase == BKVOICE_COMPANION_OTA_FAILED) != (result < 0)))
    {
      return -ERANGE;
    }

