open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_companion.c
  return 0;
}

static bool bkvoice_type_valid(uint8_t type)
{
  return type >= BKVOICE_COMPANION_HELLO &&
         type <= BKVOICE_COMPANION_OTA_REPORT;
}

static bool bkvoice_type_requires_turn(uint8_t type)
{
  return type == BKVOICE_COMPANION_TURN_START ||
         type == BKVOICE_COMPANION_AUDIO_UP ||
         type == BKVOICE_COMPANION_TURN_END ||
         type == BKVOICE_COMPANION_TTS_START ||
         type == BKVOICE_COMPANION_AUDIO_DOWN ||
         type == BKVOICE_COMPANION_TTS_END ||
         type == BKVOICE_COMPANION_VISION_START ||
         type == BKVOICE_COMPANION_VISION_CHUNK ||
         type == BKVOICE_COMPANION_VISION_END ||
         type == BKVOICE_COMPANION_CANCEL;
}

static int bkvoice_header_validate(
  const struct bkvoice_companion_header_s *header)
{
  bool end_of_stream;
  bool synthetic_type;
  bool synthetic;

  if (header == NULL)
    {
      return -EINVAL;
    }

  if (header->magic != BKVOICE_COMPANION_MAGIC ||
      header->version != BKVOICE_COMPANION_VERSION ||
      header->header_len != BKVOICE_COMPANION_HEADER_BYTES ||
      header->reserved != 0 || !bkvoice_type_valid(header->type))
    {
      return -EPROTO;
    }

  if ((header->flags & ~BKVOICE_COMPANION_FLAG_MASK) != 0 ||
      header->payload_len > BKVOICE_COMPANION_MAX_PAYLOAD ||
      header->boot_generation == 0 || header->session_id == 0 ||
      header->sequence == 0)
    {
      return -EPROTO;
    }

  if (header->type == BKVOICE_COMPANION_VISION_START ||
      header->type == BKVOICE_COMPANION_VISION_CHUNK ||
      header->type == BKVOICE_COMPANION_VISION_END)
    {
      return -ENOTSUP;
    }

  if ((bkvoice_type_requires_turn(header->type) &&
       header->turn_id == 0) ||
      ((header->type == BKVOICE_COMPANION_HELLO ||
        header->type == BKVOICE_COMPANION_WELCOME) &&
       header->turn_id != 0))
    {
      return -EPROTO;
    }

  if ((header->type == BKVOICE_COMPANION_AUDIO_UP ||
       header->type == BKVOICE_COMPANION_AUDIO_DOWN) &&
      header->payload_len != BKVOICE_COMPANION_AUDIO_FRAME_BYTES)
    {
      return -EMSGSIZE;
    }

  if (header->type == BKVOICE_COMPANION_WINDOW_UPDATE &&
      header->payload_len != sizeof(uint32_t))
    {
      return -EMSGSIZE;
    }

  if ((header->type == BKVOICE_COMPANION_HELLO &&
       header->payload_len != 0 && header->payload_len != 4) ||
      (header->type == BKVOICE_COMPANION_VOLUME_GET && header->payload_len != 0) ||
      (header->type == BKVOICE_COMPANION_VOLUME_SET && header->payload_len != 4) ||
      (header->type == BKVOICE_COMPANION_VOLUME_REPORT && header->payload_len != 12))
    {
      return -EMSGSIZE;
    }

  if (header->type >= BKVOICE_COMPANION_VOLUME_GET && header->turn_id != 0)
    {
      return -EPROTO;
    }

  if (header->type == BKVOICE_COMPANION_STATUS_REPORT &&
      (header->flags != 0 ||
       (header->payload_len != BKVOICE_COMPANION_STATUS_REPORT_BYTES &&
        header->payload_len != BKVOICE_COMPANION_STATUS_REPORT_V2_BYTES)))
    {
      return header->flags != 0 ? -EPROTO : -EMSGSIZE;
    }

  if ((header->type == BKVOICE_COMPANION_OTA_REQUEST &&
       (header->flags != 0 ||
        header->payload_len != BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES)) ||
      (header->type == BKVOICE_COMPANION_OTA_REPORT &&
       (header->flags != 0 ||
        header->payload_len != BKVOICE_COMPANION_OTA_REPORT_BYTES)))
    {
      return header->flags != 0 ? -EPROTO : -EMSGSIZE;
    }

  if ((header->type == BKVOICE_COMPANION_TURN_START ||
       header->type == BKVOICE_COMPANION_TURN_END ||
       header->type == BKVOICE_COMPANION_TTS_START ||
       header->type == BKVOICE_COMPANION_TTS_END ||
       header->type == BKVOICE_COMPANION_CANCEL ||
       header->type == BKVOICE_COMPANION_HEARTBEAT) &&
      header->payload_len != 0)
    {
      return -EMSGSIZE;
    }

  synthetic_type = header->type == BKVOICE_COMPANION_TTS_START ||
                   header->type == BKVOICE_COMPANION_AUDIO_DOWN ||
                   header->type == BKVOICE_COMPANION_TTS_END;
  synthetic = (header->flags & BKVOICE_COMPANION_FLAG_SYNTHETIC) != 0;
  if (synthetic_type && !synthetic)
    {
      return -EACCES;
    }

  if (!synthetic_type && synthetic)
    {
      return -EPROTO;
    }

  end_of_stream =
    (header->flags & BKVOICE_COMPANION_FLAG_END_OF_STREAM) != 0;
  if (end_of_stream && header->type != BKVOICE_COMPANION_AUDIO_UP &&
      header->type != BKVOICE_COMPANION_AUDIO_DOWN)
    {
      return -EPROTO;
    }

  return 0;
}

int bkvoice_companion_encode(
  const struct bkvoice_companion_header_s *header,
  const void *payload, uint8_t *frame, size_t frame_size,
  size_t *encoded_size)
{
  size_t needed;
  int ret;

  if (frame == NULL || encoded_size == NULL)
    {
      return -EINVAL;
    }

  ret = bkvoice_header_validate(header);
  if (ret < 0)
    {
      return ret;
    }

  needed = BKVOICE_COMPANION_HEADER_BYTES + header->payload_len;
  if (frame_size < needed || (header->payload_len != 0 && payload == NULL))
    {
      return -EMSGSIZE;
    }

  ret = bkvoice_volume_payload_valid(header->type, payload);
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_ota_payload_valid(header->type, payload);
  if (ret < 0)
    {
      return ret;
    }

  if (header->type == BKVOICE_COMPANION_STATUS_REPORT)
    {
      ret = bkvoice_status_payload_valid(payload, header->payload_len);
      if (ret < 0)
        {
          return ret;
        }
    }

  bkvoice_put_be32(frame, header->magic);
  frame[4] = header->version;
  frame[5] = header->type;
  bkvoice_put_be16(frame + 6, header->flags);
  bkvoice_put_be16(frame + 8, header->header_len);
  bkvoice_put_be16(frame + 10, header->reserved);
  bkvoice_put_be32(frame + 12, header->payload_len);
  bkvoice_put_be32(frame + 16, header->boot_generation);
  bkvoice_put_be32(frame + 20, header->session_id);
  bkvoice_put_be32(frame + 24, header->turn_id);
  bkvoice_put_be32(frame + 28, header->sequence);
  bkvoice_put_be64(frame + 32, header->timestamp_ms);
  if (header->payload_len != 0)
    {
      memcpy(frame + BKVOICE_COMPANION_HEADER_BYTES, payload,
             header->payload_len);
    }

