open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_companion.c
  *encoded_size = needed;
  return 0;
}

int bkvoice_companion_decode(
  const uint8_t *frame, size_t frame_size,
  struct bkvoice_companion_header_s *header,
  const uint8_t **payload)
{
  size_t needed;
  int ret;

  if (frame == NULL || header == NULL || payload == NULL)
    {
      return -EINVAL;
    }

  if (frame_size < BKVOICE_COMPANION_HEADER_BYTES)
    {
      return -EMSGSIZE;
    }

  memset(header, 0, sizeof(*header));
  header->magic = bkvoice_get_be32(frame);
  header->version = frame[4];
  header->type = frame[5];
  header->flags = bkvoice_get_be16(frame + 6);
  header->header_len = bkvoice_get_be16(frame + 8);
  header->reserved = bkvoice_get_be16(frame + 10);
  header->payload_len = bkvoice_get_be32(frame + 12);
  header->boot_generation = bkvoice_get_be32(frame + 16);
  header->session_id = bkvoice_get_be32(frame + 20);
  header->turn_id = bkvoice_get_be32(frame + 24);
  header->sequence = bkvoice_get_be32(frame + 28);
  header->timestamp_ms = bkvoice_get_be64(frame + 32);

  ret = bkvoice_header_validate(header);
  if (ret < 0)
    {
      return ret;
    }

  needed = BKVOICE_COMPANION_HEADER_BYTES + header->payload_len;
  if (frame_size != needed)
    {
      return -EMSGSIZE;
    }

  *payload = frame + BKVOICE_COMPANION_HEADER_BYTES;
  ret = bkvoice_volume_payload_valid(header->type, *payload);
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_ota_payload_valid(header->type, *payload);
  if (ret < 0)
    {
      return ret;
    }

  return header->type == BKVOICE_COMPANION_STATUS_REPORT ?
         bkvoice_status_payload_valid(*payload, header->payload_len) : 0;
}

int bkvoice_companion_session_init(
  struct bkvoice_companion_session_s *session,
  uint32_t boot_generation)
{
  if (session == NULL || boot_generation == 0)
    {
      return -EINVAL;
    }

  memset(session, 0, sizeof(*session));
  session->boot_generation = boot_generation;
  session->state = BKVOICE_COMPANION_DISCONNECTED;
  return 0;
}

int bkvoice_companion_session_connect(
  struct bkvoice_companion_session_s *session)
{
  if (session == NULL)
    {
      return -EINVAL;
    }

  if (session->state != BKVOICE_COMPANION_DISCONNECTED)
    {
      return -EALREADY;
    }

  if (session->last_session_id == UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  session->session_id = ++session->last_session_id;
  session->turn_id = 0;
  session->tx_sequence = 0;
  session->rx_sequence = 0;
  session->tx_window = 0;
  session->rx_window = 0;
  session->capabilities = 0;
  session->state = BKVOICE_COMPANION_CONNECTING;
  return 0;
}

void bkvoice_companion_session_disconnect(
  struct bkvoice_companion_session_s *session)
{
  if (session == NULL)
    {
      return;
    }

  session->session_id = 0;
  session->turn_id = 0;
  session->tx_sequence = 0;
  session->rx_sequence = 0;
  session->tx_window = 0;
  session->rx_window = 0;
  session->state = BKVOICE_COMPANION_DISCONNECTED;
}

static bool bkvoice_session_ready(
  const struct bkvoice_companion_session_s *session)
{
  return session->state == BKVOICE_COMPANION_IDLE ||
         session->state == BKVOICE_COMPANION_UPLINK ||
         session->state == BKVOICE_COMPANION_THINKING ||
         session->state == BKVOICE_COMPANION_DOWNLINK;
}

static int bkvoice_tx_transition(struct bkvoice_companion_session_s *next,
                                 uint8_t type, const uint8_t *payload,
                                 uint32_t payload_len,
                                 uint32_t *turn_id)
{
  uint32_t credit;
  bool active = next->state == BKVOICE_COMPANION_UPLINK ||
                next->state == BKVOICE_COMPANION_THINKING ||
                next->state == BKVOICE_COMPANION_DOWNLINK;

  *turn_id = active ? next->turn_id : 0;
  switch (type)
    {
      case BKVOICE_COMPANION_HELLO:
        if (next->state != BKVOICE_COMPANION_CONNECTING ||
            next->tx_sequence != 0)
          {
            return -EPERM;
          }

        if (payload_len != 0 && (payload_len != 4 || payload == NULL))
          {
            return -EINVAL;
          }

        next->capabilities = payload_len ? bkvoice_get_be32(payload) : 0;
        next->state = BKVOICE_COMPANION_HELLO_SENT;
        break;

      case BKVOICE_COMPANION_TURN_START:
        if (next->state != BKVOICE_COMPANION_IDLE)
          {
            return -EBUSY;
          }

        if (next->turn_id == UINT32_MAX)
          {
            return -EOVERFLOW;
          }

        next->turn_id++;
        *turn_id = next->turn_id;
        next->state = BKVOICE_COMPANION_UPLINK;
        break;

      case BKVOICE_COMPANION_AUDIO_UP:
        if (next->state != BKVOICE_COMPANION_UPLINK)
          {
            return -EPERM;
          }

        if (payload_len > next->tx_window)
          {
            return -EAGAIN;
          }

        next->tx_window -= payload_len;
        break;

      case BKVOICE_COMPANION_TURN_END:
        if (next->state != BKVOICE_COMPANION_UPLINK)
          {
            return -EPERM;
          }

        next->state = BKVOICE_COMPANION_THINKING;
        break;

      case BKVOICE_COMPANION_CANCEL:
        if (!active)
          {
            return -EALREADY;
          }

        next->state = BKVOICE_COMPANION_IDLE;
        break;

      case BKVOICE_COMPANION_ACK:
        if (!bkvoice_session_ready(next))
          {
            return -EPERM;
          }

        /* Completion ACK retains its turn after cleanup enters IDLE. */

        *turn_id = next->turn_id;
        break;

      case BKVOICE_COMPANION_VOLUME_REPORT:
        if (!bkvoice_session_ready(next) ||
            !(next->capabilities & BKVOICE_COMPANION_CAP_VOLUME))
          {
            return -ENOTSUP;
          }

        *turn_id = 0;
        break;

      case BKVOICE_COMPANION_STATUS_REPORT:
        if (!bkvoice_session_ready(next) ||
            !(next->capabilities & BKVOICE_COMPANION_CAP_STATUS_REPORT))
          {
            return -ENOTSUP;
          }

        *turn_id = 0;
        break;

      case BKVOICE_COMPANION_OTA_REPORT:
        if (!bkvoice_session_ready(next) ||
            !(next->capabilities & BKVOICE_COMPANION_CAP_OTA))
          {
            return -ENOTSUP;
          }

        *turn_id = 0;
        break;

      case BKVOICE_COMPANION_HEARTBEAT:
      case BKVOICE_COMPANION_ERROR:
        if (!bkvoice_session_ready(next))
          {
            return -EPERM;
          }
        break;

      case BKVOICE_COMPANION_WINDOW_UPDATE:
        if (!bkvoice_session_ready(next) || payload == NULL ||
            payload_len != sizeof(uint32_t))
          {
            return -EPERM;
          }

