open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_companion.c
        credit = bkvoice_get_be32(payload);
        if (credit == 0 || credit > BKVOICE_COMPANION_MAX_WINDOW ||
            next->rx_window > BKVOICE_COMPANION_MAX_WINDOW - credit)
          {
            return -EOVERFLOW;
          }

        next->rx_window += credit;
        break;

      default:
        return -EPERM;
    }

  return 0;
}

int bkvoice_companion_session_tx(
  struct bkvoice_companion_session_s *session, uint8_t type,
  uint16_t flags, const uint8_t *payload, uint32_t payload_len,
  uint64_t timestamp_ms,
  struct bkvoice_companion_header_s *header)
{
  struct bkvoice_companion_session_s next;
  struct bkvoice_companion_header_s candidate;
  uint32_t turn_id;
  int ret;

  if (session == NULL || header == NULL)
    {
      return -EINVAL;
    }

  if (payload_len != 0 && payload == NULL)
    {
      return -EMSGSIZE;
    }

  if (session->state == BKVOICE_COMPANION_DISCONNECTED)
    {
      return -ENOTCONN;
    }

  if (session->tx_sequence >= UINT32_MAX - 1u)
    {
      return -EOVERFLOW;
    }

  next = *session;
  ret = bkvoice_tx_transition(&next, type, payload, payload_len, &turn_id);
  if (ret < 0)
    {
      return ret;
    }

  memset(&candidate, 0, sizeof(candidate));
  candidate.magic = BKVOICE_COMPANION_MAGIC;
  candidate.version = BKVOICE_COMPANION_VERSION;
  candidate.type = type;
  candidate.flags = flags;
  candidate.header_len = BKVOICE_COMPANION_HEADER_BYTES;
  candidate.payload_len = payload_len;
  candidate.boot_generation = session->boot_generation;
  candidate.session_id = session->session_id;
  candidate.turn_id = turn_id;
  candidate.sequence = session->tx_sequence + 1u;
  candidate.timestamp_ms = timestamp_ms;

  ret = bkvoice_header_validate(&candidate);
  if (ret < 0)
    {
      return ret;
    }

  if (candidate.payload_len != 0 && payload == NULL)
    {
      return -EINVAL;
    }

  ret = bkvoice_volume_payload_valid(type, payload);
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_ota_payload_valid(type, payload);
  if (ret < 0)
    {
      return ret;
    }

  if (type == BKVOICE_COMPANION_STATUS_REPORT)
    {
      ret = bkvoice_status_payload_valid(payload, payload_len);
      if (ret < 0)
        {
          return ret;
        }
    }

  next.tx_sequence = candidate.sequence;
  *session = next;
  *header = candidate;
  return 0;
}

static int bkvoice_rx_turn_match(
  const struct bkvoice_companion_session_s *session,
  const struct bkvoice_companion_header_s *header)
{
  if (header->turn_id == 0 || header->turn_id == session->turn_id)
    {
      return 0;
    }

  return -ESTALE;
}

static int bkvoice_rx_transition(
  struct bkvoice_companion_session_s *next,
  const struct bkvoice_companion_header_s *header,
  const uint8_t *payload)
{
  uint32_t credit;
  int ret;

  switch (header->type)
    {
      case BKVOICE_COMPANION_WELCOME:
        if (next->state != BKVOICE_COMPANION_HELLO_SENT ||
            header->turn_id != 0)
          {
            return -EPERM;
          }

        next->state = BKVOICE_COMPANION_IDLE;
        break;

      case BKVOICE_COMPANION_WINDOW_UPDATE:
        if (!bkvoice_session_ready(next) || payload == NULL)
          {
            return -EPERM;
          }

        ret = bkvoice_rx_turn_match(next, header);
        if (ret < 0)
          {
            return ret;
          }

        credit = bkvoice_get_be32(payload);
        if (credit == 0 || credit > BKVOICE_COMPANION_MAX_WINDOW ||
            next->tx_window > BKVOICE_COMPANION_MAX_WINDOW - credit)
          {
            return -EOVERFLOW;
          }

        next->tx_window += credit;
        break;

      case BKVOICE_COMPANION_TTS_START:
        if (next->state != BKVOICE_COMPANION_THINKING ||
            header->turn_id != next->turn_id)
          {
            return -ESTALE;
          }

        next->state = BKVOICE_COMPANION_DOWNLINK;
        break;

      case BKVOICE_COMPANION_AUDIO_DOWN:
        if (next->state != BKVOICE_COMPANION_DOWNLINK ||
            header->turn_id != next->turn_id)
          {
            return -ESTALE;
          }

        if (next->rx_window < header->payload_len)
          {
            return -ENOBUFS;
          }

        next->rx_window -= header->payload_len;
        break;

      case BKVOICE_COMPANION_TTS_END:
        if (next->state != BKVOICE_COMPANION_DOWNLINK ||
            header->turn_id != next->turn_id)
          {
            return -ESTALE;
          }

        next->state = BKVOICE_COMPANION_IDLE;
        break;

      case BKVOICE_COMPANION_CANCEL:
        /* Local completion/cancellation can cross a remote CANCEL.  Admit
         * the same nonzero turn while idle; the turn owner makes cleanup
         * idempotent.  Never admit an old turn after the next one starts.
         */

        if (!bkvoice_session_ready(next) || header->turn_id == 0 ||
            header->turn_id != next->turn_id)
          {
            return -ESTALE;
          }

        next->state = BKVOICE_COMPANION_IDLE;
        break;

      case BKVOICE_COMPANION_ACK:
      case BKVOICE_COMPANION_HEARTBEAT:
        return bkvoice_rx_turn_match(next, header);

      case BKVOICE_COMPANION_VOLUME_GET:
      case BKVOICE_COMPANION_VOLUME_SET:
        if (!bkvoice_session_ready(next) ||
            !(next->capabilities & BKVOICE_COMPANION_CAP_VOLUME))
          {
            return -ENOTSUP;
          }

        if (header->type == BKVOICE_COMPANION_VOLUME_SET &&
            (payload == NULL || bkvoice_get_be32(payload) > 100))
          {
            return -ERANGE;
          }

        return 0;

      case BKVOICE_COMPANION_STATUS_REPORT:
        return -EPERM;

      case BKVOICE_COMPANION_OTA_REQUEST:
        if (!bkvoice_session_ready(next) ||
            !(next->capabilities & BKVOICE_COMPANION_CAP_OTA))
          {
            return -ENOTSUP;
          }

        return 0;

      case BKVOICE_COMPANION_OTA_REPORT:
        return -EPERM;

      case BKVOICE_COMPANION_ERROR:
        if (next->state == BKVOICE_COMPANION_CONNECTING ||
            next->state == BKVOICE_COMPANION_HELLO_SENT)
          {
            return -ECONNREFUSED;
          }

