open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_companion.c
        ret = bkvoice_rx_turn_match(next, header);
        if (ret < 0)
          {
            return ret;
          }

        if (header->turn_id == 0)
          {
            next->session_id = 0;
            next->turn_id = 0;
            next->tx_sequence = 0;
            next->rx_sequence = 0;
            next->tx_window = 0;
            next->rx_window = 0;
            next->state = BKVOICE_COMPANION_DISCONNECTED;
          }
        else
          {
            next->state = BKVOICE_COMPANION_IDLE;
          }
        break;

      case BKVOICE_COMPANION_VISION_START:
      case BKVOICE_COMPANION_VISION_CHUNK:
      case BKVOICE_COMPANION_VISION_END:
        return -ENOTSUP;

      default:
        return -EPERM;
    }

  return 0;
}

int bkvoice_companion_session_rx(
  struct bkvoice_companion_session_s *session,
  const struct bkvoice_companion_header_s *header,
  const uint8_t *payload)
{
  struct bkvoice_companion_session_s next;
  int ret;

  if (session == NULL)
    {
      return -EINVAL;
    }

  if (session->state == BKVOICE_COMPANION_DISCONNECTED)
    {
      return -ENOTCONN;
    }

  ret = bkvoice_header_validate(header);
  if (ret < 0)
    {
      return ret;
    }

  if (header->payload_len != 0 && payload == NULL)
    {
      return -EMSGSIZE;
    }

  ret = bkvoice_ota_payload_valid(header->type, payload);
  if (ret < 0)
    {
      return ret;
    }

  if (header->boot_generation != session->boot_generation ||
      header->session_id != session->session_id)
    {
      return -ESTALE;
    }

  if (header->sequence <= session->rx_sequence)
    {
      return -EALREADY;
    }

  if (header->sequence == UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  if (header->sequence != session->rx_sequence + 1u)
    {
      return -EPROTO;
    }

  next = *session;
  ret = bkvoice_rx_transition(&next, header, payload);
  if (ret < 0)
    {
      return ret;
    }

  if (next.state != BKVOICE_COMPANION_DISCONNECTED)
    {
      next.rx_sequence = header->sequence;
    }

  *session = next;
  return 0;
}

const char *bkvoice_companion_state_name(
  enum bkvoice_companion_state_e state)
{
  switch (state)
    {
      case BKVOICE_COMPANION_DISCONNECTED:
        return "disconnected";
      case BKVOICE_COMPANION_CONNECTING:
        return "connecting";
      case BKVOICE_COMPANION_HELLO_SENT:
        return "hello-sent";
      case BKVOICE_COMPANION_IDLE:
        return "idle";
      case BKVOICE_COMPANION_UPLINK:
        return "uplink";
      case BKVOICE_COMPANION_THINKING:
        return "thinking";
      case BKVOICE_COMPANION_DOWNLINK:
        return "downlink";
      default:
        return "invalid";
    }
}
